In [485]:
#Import libraries
#import neccessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns


from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix
from sklearn.feature_selection import RFE
from sklearn.metrics import roc_curve, auc
from sklearn.preprocessing import label_binarize
from sklearn.multiclass import OneVsRestClassifier
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import roc_auc_score

In [486]:
df = pd.read_csv(r'C:\Users\Betty.Koila\Desktop\DataScience\DSC-CapstoneProject\Data\Final_dataset_Final.csv')
df

,ID,GENDER,AGE,MARITAL_STATUS,EMPLOYMENT_STATUS,CREDIT_SCORE,SCORE_GRADE,NO_DEFAULT_LOAN,RISK_GRADE,PRODUCT,CURRENCY,NET INCOME,PRINCIPAL_DISBURSED,EMI,OD_DAYS,PRUDENTIAL_CLASSIFICATION,OD_AMOUNT,LOAN_STATUS
0,104465,MALE,NaN,NaN,NaN,480.0,JJ,1.0,B20,Premium Finance - Consumer,KES,0.00,"235,203.00","40,637.03",2995,LOSS,"45,011.10",EXPIRED
1,138046,MALE,55.0,NaN,NaN,537.0,JJ,2.0,B20,Consumer Unsecured Loan,KES,0.00,"215,000.00","7,186.79",2582,LOSS,"115,674.06",EXPIRED
2,173501,MALE,NaN,NaN,NaN,545.0,JJ,1.0,B20,Consumer Unsecured Loan,KES,0.00,"155,000.00","4,258.42",2667,LOSS,"65,541.89",EXPIRED
3,141836,MALE,NaN,NaN,NaN,626.0,HH,3.0,B20,Consumer Unsecured Loan,KES,0.00,"335,000.00","7,158.92",2810,LOSS,"297,407.57",EXPIRED
4,65973,MALE,63.0,MARRIED,EMPLOYED,524.0,JJ,2.0,B20,Consumer Unsecured Loan,KES,0.00,"105,000.00","2,136.29",2879,LOSS,"117,969.24",EXPIRED
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
115888,154303,MALE,38.0,MARRIED,SELF-EMPLOYED,624.0,HH,4.0,A5,Digital Personal Loan,KES,3090724.25,"100,000.00","34,398.05",0,NORMAL,0,CURRENT
115889,61445,MALE,43.0,MARRIED,EMPLOYED,579.0,JJ,1.0,A5,Mobile Loan,KES,819280.00,"20,746.00","21,088.53",0,NORMAL,0,CURRENT
115890,151235,MALE,27.0,SINGLE,EMPLOYED,636.0,HH,0.0,A5,Mobile Loan,KES,529145.61,"12,700.00","12,909.69",0,NORMAL,0,CURRENT
115891,181809,FEMALE,42.0,NaN,OTHER,667.0,FF,0.0,A5,Mobile Loan,KES,4129210.00,"13,000.00","13,214.64",0,NORMAL,0,CURRENT
115892,79232,MALE,26.0,SINGLE,SELF-EMPLOYED,577.0,JJ,3.0,A5,Mobile Loan,KES,228155.78,"2,876.00","2,923.48",0,NORMAL,0,CURRENT

In [487]:
# Check the number of rows to confirm
print("Total rows before cleaning:", df.shape[0])

Total rows before cleaning: 115893

In [488]:
df.isna().sum()

ID                               0
GENDER                       15776
AGE                          17456
MARITAL_STATUS               45468
EMPLOYMENT_STATUS            31760
CREDIT_SCORE                 21012
SCORE_GRADE                  21322
NO_DEFAULT_LOAN              21322
RISK_GRADE                       0
PRODUCT                          1
CURRENCY                         0
NET INCOME                       0
PRINCIPAL_DISBURSED              0
EMI                              0
OD_DAYS                          0
PRUDENTIAL_CLASSIFICATION        0
OD_AMOUNT                        0
LOAN_STATUS                      0
dtype: int64

as shown above there are alot of empty rows.

In [489]:
df.tail()

,ID,GENDER,AGE,MARITAL_STATUS,EMPLOYMENT_STATUS,CREDIT_SCORE,SCORE_GRADE,NO_DEFAULT_LOAN,RISK_GRADE,PRODUCT,CURRENCY,NET INCOME,PRINCIPAL_DISBURSED,EMI,OD_DAYS,PRUDENTIAL_CLASSIFICATION,OD_AMOUNT,LOAN_STATUS
115888,154303,MALE,38.0,MARRIED,SELF-EMPLOYED,624.0,HH,4.0,A5,Digital Personal Loan,KES,3090724.25,"100,000.00","34,398.05",0,NORMAL,0,CURRENT
115889,61445,MALE,43.0,MARRIED,EMPLOYED,579.0,JJ,1.0,A5,Mobile Loan,KES,819280.00,"20,746.00","21,088.53",0,NORMAL,0,CURRENT
115890,151235,MALE,27.0,SINGLE,EMPLOYED,636.0,HH,0.0,A5,Mobile Loan,KES,529145.61,"12,700.00","12,909.69",0,NORMAL,0,CURRENT
115891,181809,FEMALE,42.0,NaN,OTHER,667.0,FF,0.0,A5,Mobile Loan,KES,4129210.00,"13,000.00","13,214.64",0,NORMAL,0,CURRENT
115892,79232,MALE,26.0,SINGLE,SELF-EMPLOYED,577.0,JJ,3.0,A5,Mobile Loan,KES,228155.78,"2,876.00","2,923.48",0,NORMAL,0,CURRENT

There are NAN rows after the first 18,196 rows.

In [490]:
# Keep only the first 18,196 rows
#df_cleaned = df.head(18196)

# Check the shape of the cleaned dataset
#print("Rows after cleaning:", df_cleaned.shape[0])
#df_cleaned.to_csv(r"C:\Users\Betty.Koila\Desktop\DataScience\DSC-CapstoneProject\Data\Cleaned_dataset.csv", index=False)

In [491]:
df.shape

(115893, 18)

In [492]:
# Show the data types of all columns
df.dtypes

ID                             int64
GENDER                        object
AGE                          float64
MARITAL_STATUS                object
EMPLOYMENT_STATUS             object
CREDIT_SCORE                 float64
SCORE_GRADE                   object
NO_DEFAULT_LOAN              float64
RISK_GRADE                    object
PRODUCT                       object
CURRENCY                      object
NET INCOME                   float64
PRINCIPAL_DISBURSED           object
EMI                           object
OD_DAYS                        int64
PRUDENTIAL_CLASSIFICATION     object
OD_AMOUNT                     object
LOAN_STATUS                   object
dtype: object

In [493]:
df.loc[:, ["EMI", "OD_AMOUNT", "PRINCIPAL_DISBURSED"]]

              EMI   OD_AMOUNT PRINCIPAL_DISBURSED
0       40,637.03   45,011.10          235,203.00
1        7,186.79  115,674.06          215,000.00
2        4,258.42   65,541.89          155,000.00
3        7,158.92  297,407.57          335,000.00
4        2,136.29  117,969.24          105,000.00
...           ...         ...                 ...
115888  34,398.05           0          100,000.00
115889  21,088.53           0           20,746.00
115890  12,909.69           0           12,700.00
115891  13,214.64           0           13,000.00
115892   2,923.48           0            2,876.00

[115893 rows x 3 columns]

In [494]:
df["EMI"] = df["EMI"].astype(str).str.replace(",", "").astype(float)
df["OD_AMOUNT"] = df["OD_AMOUNT"].astype(str).str.replace(",", "").astype(float)
df["PRINCIPAL_DISBURSED"] = df["PRINCIPAL_DISBURSED"].astype(str).str.replace(",", "").astype(float)

In [495]:
df.loc[:, ["EMI", "OD_AMOUNT", "PRINCIPAL_DISBURSED"]]

             EMI  OD_AMOUNT  PRINCIPAL_DISBURSED
0       40637.03   45011.10             235203.0
1        7186.79  115674.06             215000.0
2        4258.42   65541.89             155000.0
3        7158.92  297407.57             335000.0
4        2136.29  117969.24             105000.0
...          ...        ...                  ...
115888  34398.05       0.00             100000.0
115889  21088.53       0.00              20746.0
115890  12909.69       0.00              12700.0
115891  13214.64       0.00              13000.0
115892   2923.48       0.00               2876.0

[115893 rows x 3 columns]

Dropped NAN for the CREDIT_SCORE,GENDER as filling them would have misrepresented the data.

In [496]:
df.dropna(subset=["CREDIT_SCORE", "SCORE_GRADE", "GENDER","AGE","EMPLOYMENT_STATUS"], inplace=True)

In [497]:
df["MARITAL_STATUS"] = df["MARITAL_STATUS"].fillna("OTHER")

In [498]:
df.isna().sum()

ID                           0
GENDER                       0
AGE                          0
MARITAL_STATUS               0
EMPLOYMENT_STATUS            0
CREDIT_SCORE                 0
SCORE_GRADE                  0
NO_DEFAULT_LOAN              0
RISK_GRADE                   0
PRODUCT                      0
CURRENCY                     0
NET INCOME                   0
PRINCIPAL_DISBURSED          0
EMI                          0
OD_DAYS                      0
PRUDENTIAL_CLASSIFICATION    0
OD_AMOUNT                    0
LOAN_STATUS                  0
dtype: int64

In [499]:
df["MARITAL_STATUS"].value_counts()

MARRIED     40826
SINGLE      22467
OTHER       15588
WIDOWED       163
ENGAGED        99
DIVORCED       99
PARTNER        29
Name: MARITAL_STATUS, dtype: int64

In [500]:
print("Total rows before cleaning:", df.shape[0])

Total rows before cleaning: 79271

In [501]:
df["PRUDENTIAL_CLASSIFICATION"].value_counts()

NORMAL         60963
LOSS            9700
DOUBTFUL        3308
WATCH           3042
SUBSTANDARD     2258
Name: PRUDENTIAL_CLASSIFICATION, dtype: int64

In [502]:
# Define default vs. non-default conditions
df['DEFAULT_STATUS'] = np.where(df['PRUDENTIAL_CLASSIFICATION'].isin(['SUBSTANDARD', 'DOUBTFUL', 'LOSS']), 'DEFAULT', 'NON-DEFAULT')

In [503]:
df['DEFAULT_STATUS'].value_counts()

NON-DEFAULT    64005
DEFAULT        15266
Name: DEFAULT_STATUS, dtype: int64

In [504]:
df.to_csv('cleaned_dataset.csv', index=False)